package xlink.rest.demo.rest;

public class ERROR_CODE {

	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/**
	 * HTTP 400 下返回的错误异常
	 */
	/**
	 * 请求数据字段验证不通过
	 */
	public static final int PARAM_VALID_ERROR = 4001001;
	/**
	 * 请求数据必须字段不可为空
	 */
	public static final int PARAM_MUST_NOT_NULL = 4001002;
	/**
	 * 帐号密码错误
	 */
	public static final int PASSWORD_ERROR = 4001003;
	/**
	 * 获取token的code非法
	 */
	public static final int CODE_INVALID = 4001004;
	/**
	 * 获取token的refleshToken非法
	 */
	public static final int REFLESH_TOKEN_INVALID = 4001005;
	/**
	 * 授权方式不存在
	 */
	public static final int GRANT_TYPE_UNKNOWN = 4001006;
	/**
	 * 功能不可用
	 */
	public static final int FUNCTION_NOT_USED = 4001007;
	/**
	 * 路径请求参数不能为空
	 */
	public static final int URL_PARAM_MUST_NOT_NULL = 4001008;
	/**
	 * 设备标识不能为空
	 */
	public static final int ID_MUST_NOT_NULL = 4001009;
	/**
	 * 单位（分组）标识不能为空
	 */
	public static final int GROUP_MUST_NOT_NULL = 4001010;
	
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/**
	 * HTTP 403 下返回的错误
	 */
	/**
	 * 禁止访问
	 */
	public static final int INVALID_ACCESS = 4031001;
	/**
	 * 禁止访问，需要Access-Token
	 */
	public static final int NEED_ACCESS_TOKEN = 4031002;
	/**
	 * 无效的Access-Token
	 */
	public static final int ACCESS_TOKEN_INVALID = 4031003;
	
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/**
	 * HTTP 404 下返回的错误
	 */
	/**
	 * URL找不到
	 */
	public static final int URL_NOT_FOUND = 4041001;

	/**
	 * client不存在
	 */
	public static final int CLIENT_NOT_EXIST = 4001002;
	
	/**
	 * user不存在
	 */
	public static final int USER_NOT_EXIST = 4001003;
	
	/**
	 * xlinkIotClient不存在
	 */
	public static final int XLINKIOTCLIENT_NOT_EXIST = 4001004;
	
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/******************************* 错误码分隔符 ********************************/
	/**
	 * HTTP 503下返回的错误
	 */
	/**
	 * 服务端发生异常
	 */
	public static final int SERVICE_EXCEPTION = 5031001;

}
